In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from math import sqrt
from scipy import stats

import warnings
warnings.filterwarnings("ignore")

from wrangle import wrangle_telco

In [2]:
df = wrangle_telco(cached = True)
df

     customer_id  monthly_charges  tenure total_charges
0     0013-SMEOE           109.70      71       7904.25
1     0014-BMAQU            84.65      63        5377.8
2     0016-QLJIS            90.45      65        5957.9
3     0017-DINOC            45.20      54       2460.55
4     0017-IUDMW           116.80      72       8456.75
...          ...              ...     ...           ...
1690  9964-WBQDJ            24.40      71        1725.4
1691  9972-EWRJS            19.25      67        1372.9
1692  9975-GPKZU            19.75      46         856.5
1693  9993-LHIEB            67.85      67       4627.65
1694  9995-HOTOH            59.00      63        3707.6

[1695 rows x 4 columns]

In [5]:
df.describe()

       monthly_charges       tenure
count      1695.000000  1695.000000
mean         60.770413    56.735103
std          34.678865    18.209363
min          18.400000     0.000000
25%          24.025000    48.000000
50%          64.350000    64.000000
75%          90.450000    71.000000
max         118.750000    72.000000

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1695 non-null   object
 1   monthly_charges  1695 non-null   float64
 2   tenure           1695 non-null   int64
 3   total_charges    1695 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 53.1+ KB

In [4]:
df.isnull().sum()

customer_id        0
monthly_charges    0
tenure             0
total_charges      0
dtype: int64

## Takeaway:
1. Change total_charges to float, and replace NaN values with 0

In [6]:
df['total_charges'] = pd.to_numeric(df['total_charges'],errors='coerce')
df["total_charges"].fillna(0, inplace = True)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1695 non-null   object
 1   monthly_charges  1695 non-null   float64
 2   tenure           1695 non-null   int64
 3   total_charges    1695 non-null   float64
dtypes: float64(2), int64(1), object(1)
memory usage: 53.1+ KB

In [8]:
df.describe()

       monthly_charges       tenure  total_charges
count      1695.000000  1695.000000    1695.000000
mean         60.770413    56.735103    3706.934336
std          34.678865    18.209363    2579.517834
min          18.400000     0.000000       0.000000
25%          24.025000    48.000000    1269.675000
50%          64.350000    64.000000    3593.800000
75%          90.450000    71.000000    5988.800000
max         118.750000    72.000000    8672.450000

## Added changes to warangle file, time to test if they work

In [9]:
df = wrangle_telco(cached = False)
df

     customer_id  monthly_charges  tenure total_charges
0     0013-SMEOE           109.70      71       7904.25
1     0014-BMAQU            84.65      63        5377.8
2     0016-QLJIS            90.45      65        5957.9
3     0017-DINOC            45.20      54       2460.55
4     0017-IUDMW           116.80      72       8456.75
...          ...              ...     ...           ...
1690  9964-WBQDJ            24.40      71        1725.4
1691  9972-EWRJS            19.25      67        1372.9
1692  9975-GPKZU            19.75      46         856.5
1693  9993-LHIEB            67.85      67       4627.65
1694  9995-HOTOH            59.00      63        3707.6

[1695 rows x 4 columns]